ObidjonovM/codes_for_mikrocontrollers/ESP8266_Gerkon/ESP8266_D1_mini_Gerkon_M1_V1/src/main.cpp
String javaScript() {
  String content = "<script>";
  content += "var ssid = document.getElementById('ssid');\n";
  content += "var must_show = document.querySelectorAll('.must-show');\n";
  content += "var div_ssid = document.querySelectorAll('.div-ssid');\n";
  if (ssidList == "") {
    content += "ssid.focus();\n";
  }
  content += "function showIconFunction(e){\n";
  content += "e.parentNode.querySelector('.password').type = 'text';\n";
  content += "e.style.display = 'none';\n";
  content += "e.parentNode.querySelector('.hide-icon').style.display = 'inline-block';\n";
  content += "event.stopPropagation();\n";
  content += "};\n";
  content += "function hideIconFunction(e){\n";
  content += "e.parentNode.querySelector('.password').type = 'password';\n";
  content += "e.style.display = 'none';\n";
  content += "e.parentNode.querySelector('.show-icon').style.display = 'inline-block';\n";
  content += "event.stopPropagation();\n";
  content += "};\n";
  content += "function showInfo(e){\n";
  content += "for (let i =0; i < div_ssid.length; i++) {\n";
  content += "if(div_ssid[i] == e){\n";
  content += "div_ssid[i].classList.add('selected-ssid');\n";
  content += "div_ssid[i].classList.remove('must-hover');\n";
  content += "must_show[i].classList.remove('hide');\n";
  content += "} else {\n";
  content += "div_ssid[i].classList.remove('selected-ssid');\n";
  content += "div_ssid[i].classList.add('must-hover');\n";
  content += "must_show[i].classList.add('hide');\n";
  content += "div_ssid[i].querySelector('form').reset();\n";
  content += "};\n";
  content += "};\n";
  content += "let sel_must_show = e.querySelector('.must-show');\n";
  content += "if(sel_must_show.querySelector('.password') != null){\n";
  content += "sel_must_show.querySelector('.password').focus();\n";
  content += "} else {\n";
  content += "sel_must_show.querySelector('.submit').focus();\n";
  content += "};\n";
  content += "};\n";
  content += "function reloadPage(){\n";
  content += "window.location.reload();\n";
  content += "};\n";
  content += "</script>";
  return content;
}

String routerHTML() {
  String content = "<!DOCTYPE HTML>";
  content += "<html>";
  content += "<head>";
  content += "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">";
  content += "<meta charset=\"UTF-8\">";
  content += "<title>Настройки роутера</title>";
  content += "</head>";
  content += css();
  content += "<body>";
  content += "<h1 class = 'fido-electronics'>Fido Electronics</h1>";
  content += "<div class=\"container\">";
  if (ssidList != "") {
    content += "<p class = 'comment'>Выберите одну из следующих доступных сетей для подключения вашего устройства к интернету:</p>";
    content += "<div class='list-ssid' id='listSsid'>";
    content += ssidList;
    content += "</div>";
  }else {
    content += "<p class = 'comment'>Введите имя(SSID) для сети и ключ безопасности сети для подключения вашего устройства к интернету:</p>";
    content += "<form method=\"POST\" class=\"unique-form\">";
    content += "<label for=\"login\">Имя сети(SSID):</label>";
    content += "<input id = \"ssid\" type=\"text\" name=\"ssid\" placeholder = \"Введите имя(SSID) для сети...\" required>";
    content += "<label for=\"password\">Ключ безопасности сети:</label>";
    content += "<div class = \"parent-eye-icon\">";
    content += "<input class = \"password\" type=\"password\" name=\"routerPass\" placeholder = \"Введите ключ безопасности сети...\" required>";
    content += "<img class = \"eye-icon show-icon hide\" onclick = \"showIconFunction(this)\" src = \"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADIAAAAnCAYAAABNJBuZAAAABGdBTUEAALGPC/xhBQAAACBjSFJNAAB6JgAAgIQAAPoAAACA6AAAdTAAAOpgAAA6mAAAF3CculE8AAAABmJLR0QA/wD/AP+gvaeTAAAAB3RJTUUH5gICBSIWia34TgAABBVJREFUWMPt18tvlFUch/Hne973nZnO9DLQDtKGAhaIFjEtRjeALsBLiInu1EjiQvFCMIatmniJbnRj4t7gxihiWBCiCCFqDYSFQbxRKNFyaatcSmdKp3N73/Nz4X/Q1qaL+ezPe86Tk5NzXmhqampqampqWnL0/3xV5Ff0kjTqpDI5zDwzxRtEmSzlqetLP6S7b5Dl7TuYqZxF5JCyQCdYFVTCqACzSCluTZ6jdP3q0grJ5rvoKgxgFhMEXXgr5Z1L3y8Fg6C8wBuMm8Wn0fQf5jviOB7HuVauXvxxaYQUejfS1rqZOJ7E++lMEOSflAueEBSBCcOqAiF1mLEGKJkl+6Ow70y9cR4pYGz0e5J6bV7rCOYz+I41A6zv/ZjpmSG81XuDoO1dyfWh+ACmFlA/qANUANogOYHZOLjd3hc7ofKriJL2Zesoz07g48bi70hhdT/dhZe4Xf4B76ubpOgtsCFv5YNOuTeRprD6YW+kBQ05l8PC58FOeKt9J6VfF7rurfqBFM4K49LIt2C2eDsSZlooFLZSq/+JWa1fit4D/1Wgvv1G+TlJWe+rh1BqnwgGUfAQKIfVPpGi3S7QKZ/MfAmp7VK4DWqnQHG+cw2lydE5hbi5DEqls3g/g/fVbil6Q7KDYdB1oJ78npXcFuf84cBl9jinY3E89rJR2SPUJRfdh+ykmXvYueWz3qbfF2RFy2tm08Fcd2POIS25PGG4Ail6VmKqXt75Reyv4IKoA8x5n9SR6wgj/3W6pavhaCkiOyqFA5CMg3oCtxLn0mWj+hHSTil/L8osboiZx/tpwA+Z0RNmj2zGspglFf47d8LMxw3bgC0jk1qHeTaBv4ZpGXDb2y3aWx8BS+8ERlAyipI5h8zpjGRyHZguk4runjCrzqLwVUiGU27VFW/lAVC7WXwagr1mjbVxMvW45DaY1T4V0TNyHAnCjtFK5dwuyT2K4ndEeE04ijcvLl5ItVwi37kJbyUyqXtGkuRWAwX7vC+NQTwE4Ytgw8h/IwV5iTGjfghLP+Wcyokvfu6T5AUp2CH5t0U06tTKVPEM1ZnSnELmdSH2rt8G8qTCjcR+Yju4vVhyHPywlNqFMMxGgAxSP9h58/XjkHpaUiCXfIiF444Cs/Wf+PuvX+a8lnnf7L0btuKtShSsxqjcCcEr4HogOSuIkWsDYswXQd2gfsQxVPtMlq5IWSq1C/OKWJAQgJ51D9Da8iD1+DzoH4et3AzBYxirgTTII5sR/IaSo+bzY7hJRMjkzZ+ZvjEx7zUs2Os3asmxau0WvNURreCXo2AibRZl5eTlSjPW6E7kKlTjn4lcH5cvnFyo6Rf+f0QupKdvkCSpkEl3gVJI4H2VS8NDFHrv4ubYyEJP29TU1NTU1NS0FP0LqhDKDpwtSjsAAAAldEVYdGRhdGU6Y3JlYXRlADIwMjItMDItMDJUMDU6MzQ6MTkrMDA6MDAFzLzFAAAAJXRFWHRkYXRlOm1vZGlmeQAyMDIyLTAyLTAyVDA1OjM0OjE5KzAwOjAwdJEEeQAAAABJRU5ErkJggg==\">";
    content += "<img class = \"eye-icon hide-icon hide\" onclick = \"hideIconFunction(this)\" src = \"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADIAAAAnCAYAAABNJBuZAAAABGdBTUEAALGPC/xhBQAAACBjSFJNAAB6JgAAgIQAAPoAAACA6AAAdTAAAOpgAAA6mAAAF3CculE8AAAABmJLR0QA/wD/AP+gvaeTAAAAB3RJTUUH5gICBSERPOQ+LgAABAlJREFUWMPtlstvVVUUh7/fPuf0Puhtb0hLsbRQimgwQRxUESEmxPgm0agMNGFgdKAxER8hJiYGNNUhMXHC1IExmCg4IT4GgolRFA0SIigvI6WALdCW297b07P3coD+A7dXdHC+6d7Z6/ftlay9IScnJycnJyfnf4dafWDXkpV0d2+gVjtBFFWAGCFMHphjunYKs4QkKWLm8SFl7Oyv864btUqgs7uXG/o3EEVFQnB4Xys4V1gJ3AbcjFgINNrLQ/U4KTAzfcxFrtN8NkO9NjHv+i3pSO/yISYmDtG9aBPeT7bHUWUTuHslFQ0mwDKhqhkFsJ8MfxC408LMLgiTF0YPk05fnVeGeXekb3AdRqBavZvgp9e4qPSWU9Qnhf1mpAZVQRFsHPx3klstFd6U02QIE3udq2QdHcupp2P4tPHfiPTduB4j0NGxgTQdeci5ZJsIe8yyryDZIqdJs+xL8IclNyeXPA7RchTeN7OK04JbITsk3Fylo5+ZxkV8mjaVxTUr0Ts4hFmdUmE19Znjj0rxs8gPB2t8LrW9iMLHIUu/weJHIHkSc33AHLIY8z96P/EyUBaFN4x0ARi9fXc1falNiwz07aQtGWQuO3ePXLxFzu8QhR+cK90vx6iFbFyu7Tm5sBfLvpCLnpeUmqXDKNqcFGlk2eUdmCFKr5nV28wyFi1ddX1FRs4P4/3kgFz0kuR3QtuROK6CaZVkR6TkPhfxSZY1TkrxE+B3QoikcBGzSsjKXVFcrvsw9TawFNqfitxizEJTeeJmRSQwA8DMDDDs7zUDJGFmK+Ko/KCkTy1M78e1r7u2F/0zMM0Q4CQkNT9Em+5IpX0Tkav8bsG/i0WvWmiszrIrIDtugTUonIFkm5ymgqW/QfkVzH42U5egFie1cZ/Vi1Hc+Towgq5+4MN5mpVpemol5TGMSZJo5ZnA1JwUbzWbPQWNH5yKT6NoI/jdZlZ0ijci+yWE+mdOhRfk7MPZRmM0jqvbhYtRfVgq1Z0TIycPXl+Rq1dGqXYN4m2MYtu6Y1kYrUnxVkiqctFNoHazcMJCtg/Ct6CS1PYMsgPBp0fjqLJd0rhc4x3RVkOOkbNfE9K5pvLM+2XvX7keY44kXkYItc1S4T3JzlpId4FbDFoGcsgmMH/ETD2SW4vY46Kp3RYWZOKaRFpr/nVvyRelc1EfPT0PMDs78phzccEgxfQwWGRmk5ICRgFRQToK2UeRFp72XEBE/HHqAD6dnVeGlv1+V9xyO2k66wqFtcH7SwS7VBTlAXD9QAI2hrIzkQbGvY1wbnwfPdU7GDn5fUvqt0QkLhZZsmwI71OEKJZ6SdPLSCWw5FoZebBZ0uxPoqjMudOHCFnWqnvMycnJycnJycn5F/kLywjQLv5HliQAAAAldEVYdGRhdGU6Y3JlYXRlADIwMjItMDItMDJUMDU6MzM6MTMrMDA6MDBDYPjyAAAAJXRFWHRkYXRlOm1vZGlmeQAyMDIyLTAyLTAyVDA1OjMzOjEzKzAwOjAwMj1ATgAAAABJRU5ErkJggg==\">";
    content += "</div>";
    content += "<input class=\"submit\" type=\"submit\" value=\"Подключиться\">";
    content += "</form>";
  }
  content += "<input type=\"button\" class=\"scan-button\" value=\"Обновить\" onclick=\"reloadPage()\">";
  content += "</div>";
  content += javaScript();
  content += "</body>";
  content += "</html>";
  return content;
}

void writeScanNetworks() {
  int n = WiFi.scanNetworks();
  ssidList = "";
  for (int i = 0; i < n; ++i) {
    // Print SSID and RSSI for each network found
    ssidList += "<div class='div-ssid must-hover' onclick='showInfo(this)'>";
    ssidList += "<span>";
    ssidList += WiFi.SSID(i);
    ssidList += "</span>";
    ssidList += "<span style='position: absolute; right:0.3em;'>";
    if (WiFi.encryptionType(i) != ENC_TYPE_NONE) {
      ssidList += "<img width='16px' src='data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABoAAAAaCAYAAACpSkzOAAAABmJLR0QA/wD/AP+gvaeTAAABHUlEQVRIic2VQWrCQBSGP0VSEKHg2lD1HAq9Rem2duei10i9hmeQUnAtuHZT6NboQrrSgN0YFxp4iHnjzETxwYPAfPN/mUkyAft6Aj6BGbAGNsfrAdB0yDtbPSAB0pxOgDdfySuwUyRZ74AXV0kd+BNhU+AZqB67C0zE+Ap4dBF9iJBfoHaGqQI/guu7iL5FwLvC9QQ3chEtRUBL4dqCm7uI/kVAoHAPgtvKgdKFotRijg172wo4nAALzN9OXsdAhL7dRB6C0440kc9KTnupPaxUGbOucpFh1xKNgAYQAl8+N2Ha94ZgQxPvs6Ig59q6TCsaC3Zs4n3fumy+kb3ZW1fxnN/hwoPzLj7YRYGeWBMNCxSpWQGHUzemgN/EHtOMriKlrZeFAAAAAElFTkSuQmCC'>";
    }
    ssidList += " (";
    ssidList += WiFi.RSSI(i);
    ssidList += ")";
    ssidList += "</span>";
    ssidList += "<form method=\"POST\">";
    ssidList += "<input style=\"display: none;\" value = \""+WiFi.SSID(i)+"\" type=\"text\" name=\"ssid\">";
    ssidList += "<div class = \"hide must-show\">";
    if (WiFi.encryptionType(i) != ENC_TYPE_NONE) {
      ssidList += "<label for=\"password\">Ключ безопасности сети:</label>";
      ssidList += "<div class = \"parent-eye-icon\">";
      ssidList += "<input class = \"password\" type=\"password\" name=\"routerPass\" placeholder = \"Введите ключ безопасности сети...\" required  onclick=\"event.stopPropagation();\">";
      ssidList += "<img class = \"eye-icon show-icon\" onclick = \"showIconFunction(this)\" src = \"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADIAAAAnCAYAAABNJBuZAAAABGdBTUEAALGPC/xhBQAAACBjSFJNAAB6JgAAgIQAAPoAAACA6AAAdTAAAOpgAAA6mAAAF3CculE8AAAABmJLR0QA/wD/AP+gvaeTAAAAB3RJTUUH5gICBSIWia34TgAABBVJREFUWMPt18tvlFUch/Hne973nZnO9DLQDtKGAhaIFjEtRjeALsBLiInu1EjiQvFCMIatmniJbnRj4t7gxihiWBCiCCFqDYSFQbxRKNFyaatcSmdKp3N73/Nz4X/Q1qaL+ezPe86Tk5NzXmhqampqampqWnL0/3xV5Ff0kjTqpDI5zDwzxRtEmSzlqetLP6S7b5Dl7TuYqZxF5JCyQCdYFVTCqACzSCluTZ6jdP3q0grJ5rvoKgxgFhMEXXgr5Z1L3y8Fg6C8wBuMm8Wn0fQf5jviOB7HuVauXvxxaYQUejfS1rqZOJ7E++lMEOSflAueEBSBCcOqAiF1mLEGKJkl+6Ow70y9cR4pYGz0e5J6bV7rCOYz+I41A6zv/ZjpmSG81XuDoO1dyfWh+ACmFlA/qANUANogOYHZOLjd3hc7ofKriJL2Zesoz07g48bi70hhdT/dhZe4Xf4B76ubpOgtsCFv5YNOuTeRprD6YW+kBQ05l8PC58FOeKt9J6VfF7rurfqBFM4K49LIt2C2eDsSZlooFLZSq/+JWa1fit4D/1Wgvv1G+TlJWe+rh1BqnwgGUfAQKIfVPpGi3S7QKZ/MfAmp7VK4DWqnQHG+cw2lydE5hbi5DEqls3g/g/fVbil6Q7KDYdB1oJ78npXcFuf84cBl9jinY3E89rJR2SPUJRfdh+ykmXvYueWz3qbfF2RFy2tm08Fcd2POIS25PGG4Ail6VmKqXt75Reyv4IKoA8x5n9SR6wgj/3W6pavhaCkiOyqFA5CMg3oCtxLn0mWj+hHSTil/L8osboiZx/tpwA+Z0RNmj2zGspglFf47d8LMxw3bgC0jk1qHeTaBv4ZpGXDb2y3aWx8BS+8ERlAyipI5h8zpjGRyHZguk4runjCrzqLwVUiGU27VFW/lAVC7WXwagr1mjbVxMvW45DaY1T4V0TNyHAnCjtFK5dwuyT2K4ndEeE04ijcvLl5ItVwi37kJbyUyqXtGkuRWAwX7vC+NQTwE4Ytgw8h/IwV5iTGjfghLP+Wcyokvfu6T5AUp2CH5t0U06tTKVPEM1ZnSnELmdSH2rt8G8qTCjcR+Yju4vVhyHPywlNqFMMxGgAxSP9h58/XjkHpaUiCXfIiF444Cs/Wf+PuvX+a8lnnf7L0btuKtShSsxqjcCcEr4HogOSuIkWsDYswXQd2gfsQxVPtMlq5IWSq1C/OKWJAQgJ51D9Da8iD1+DzoH4et3AzBYxirgTTII5sR/IaSo+bzY7hJRMjkzZ+ZvjEx7zUs2Os3asmxau0WvNURreCXo2AibRZl5eTlSjPW6E7kKlTjn4lcH5cvnFyo6Rf+f0QupKdvkCSpkEl3gVJI4H2VS8NDFHrv4ubYyEJP29TU1NTU1NS0FP0LqhDKDpwtSjsAAAAldEVYdGRhdGU6Y3JlYXRlADIwMjItMDItMDJUMDU6MzQ6MTkrMDA6MDAFzLzFAAAAJXRFWHRkYXRlOm1vZGlmeQAyMDIyLTAyLTAyVDA1OjM0OjE5KzAwOjAwdJEEeQAAAABJRU5ErkJggg==\">";
      ssidList += "<img class = \"eye-icon hide-icon hide\" onclick = \"hideIconFunction(this)\" src = \"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADIAAAAnCAYAAABNJBuZAAAABGdBTUEAALGPC/xhBQAAACBjSFJNAAB6JgAAgIQAAPoAAACA6AAAdTAAAOpgAAA6mAAAF3CculE8AAAABmJLR0QA/wD/AP+gvaeTAAAAB3RJTUUH5gICBSERPOQ+LgAABAlJREFUWMPtlstvVVUUh7/fPuf0Puhtb0hLsbRQimgwQRxUESEmxPgm0agMNGFgdKAxER8hJiYGNNUhMXHC1IExmCg4IT4GgolRFA0SIigvI6WALdCW297b07P3coD+A7dXdHC+6d7Z6/ftlay9IScnJycnJyfnf4dafWDXkpV0d2+gVjtBFFWAGCFMHphjunYKs4QkKWLm8SFl7Oyv864btUqgs7uXG/o3EEVFQnB4Xys4V1gJ3AbcjFgINNrLQ/U4KTAzfcxFrtN8NkO9NjHv+i3pSO/yISYmDtG9aBPeT7bHUWUTuHslFQ0mwDKhqhkFsJ8MfxC408LMLgiTF0YPk05fnVeGeXekb3AdRqBavZvgp9e4qPSWU9Qnhf1mpAZVQRFsHPx3klstFd6U02QIE3udq2QdHcupp2P4tPHfiPTduB4j0NGxgTQdeci5ZJsIe8yyryDZIqdJs+xL8IclNyeXPA7RchTeN7OK04JbITsk3Fylo5+ZxkV8mjaVxTUr0Ts4hFmdUmE19Znjj0rxs8gPB2t8LrW9iMLHIUu/weJHIHkSc33AHLIY8z96P/EyUBaFN4x0ARi9fXc1falNiwz07aQtGWQuO3ePXLxFzu8QhR+cK90vx6iFbFyu7Tm5sBfLvpCLnpeUmqXDKNqcFGlk2eUdmCFKr5nV28wyFi1ddX1FRs4P4/3kgFz0kuR3QtuROK6CaZVkR6TkPhfxSZY1TkrxE+B3QoikcBGzSsjKXVFcrvsw9TawFNqfitxizEJTeeJmRSQwA8DMDDDs7zUDJGFmK+Ko/KCkTy1M78e1r7u2F/0zMM0Q4CQkNT9Em+5IpX0Tkav8bsG/i0WvWmiszrIrIDtugTUonIFkm5ymgqW/QfkVzH42U5egFie1cZ/Vi1Hc+Towgq5+4MN5mpVpemol5TGMSZJo5ZnA1JwUbzWbPQWNH5yKT6NoI/jdZlZ0ijci+yWE+mdOhRfk7MPZRmM0jqvbhYtRfVgq1Z0TIycPXl+Rq1dGqXYN4m2MYtu6Y1kYrUnxVkiqctFNoHazcMJCtg/Ct6CS1PYMsgPBp0fjqLJd0rhc4x3RVkOOkbNfE9K5pvLM+2XvX7keY44kXkYItc1S4T3JzlpId4FbDFoGcsgmMH/ETD2SW4vY46Kp3RYWZOKaRFpr/nVvyRelc1EfPT0PMDs78phzccEgxfQwWGRmk5ICRgFRQToK2UeRFp72XEBE/HHqAD6dnVeGlv1+V9xyO2k66wqFtcH7SwS7VBTlAXD9QAI2hrIzkQbGvY1wbnwfPdU7GDn5fUvqt0QkLhZZsmwI71OEKJZ6SdPLSCWw5FoZebBZ0uxPoqjMudOHCFnWqnvMycnJycnJycn5F/kLywjQLv5HliQAAAAldEVYdGRhdGU6Y3JlYXRlADIwMjItMDItMDJUMDU6MzM6MTMrMDA6MDBDYPjyAAAAJXRFWHRkYXRlOm1vZGlmeQAyMDIyLTAyLTAyVDA1OjMzOjEzKzAwOjAwMj1ATgAAAABJRU5ErkJggg==\">";
      ssidList += "</div>";
    }
    ssidList += "<input class=\"submit\" type=\"submit\" value=\"Подключиться\" onclick=\"event.stopPropagation();\">";
    ssidList += "</div>";
    ssidList += "</form>";
    ssidList += "</div>";
  }
}

void fidoDelay(unsigned long duration) {
  for (unsigned long i = 0; i < duration; i++) {
    delay(1);
  }
}

