ObidjonovM/codes_for_mikrocontrollers/ESP8266_Gerkon/ESP8266_D1_mini_Gerkon_M1_V1/src/main.cpp
////////////////////////// EEPROM functions///////////////////////////////////////////////////
byte fieldLen;
char ch;
String readFromEEPROM(int stPos) {
  String result;

  // reading the field length from the memory
  EEPROM.get(stPos, fieldLen);

  // reading the field from the memory
  for (int i = stPos + 1; i <= stPos + fieldLen; i++) {
    EEPROM.get(i, ch);
    result += ch;
  }

  return result;
}

bool writeEEPROM(String txt, int stPos) {
  // save the text length to memory
  byte txtLen = byte(txt.length());
  EEPROM.put(stPos, txtLen);

  // save the text to memeory
  for (int i = 1; i <= txtLen; i++) {
    EEPROM.put(stPos + i, char(txt[i - 1]));
    fidoDelay(10);
  }

  return EEPROM.commitReset();
}

void loadCredentials() {
  EEPROM.begin(MEMORY_SIZE);

  // reading stamp value
  int startPos = OFFSET;
  stamp = readFromEEPROM(startPos);
  if (stamp == STAMP) {
    // reading apLogin value
    startPos += stamp.length() + 1;
    apLogin = readFromEEPROM(startPos);

    // reading settingsStamp value
    startPos += apLogin.length() + 1;
    settingsStamp = readFromEEPROM(startPos);

    if (settingsStamp == SETTINGS_STAMP) {
      // reading slaveServer value
      startPos += settingsStamp.length() + 1;
      slaveServer = readFromEEPROM(startPos);

      // reading routerLogin value
      startPos += slaveServer.length() + 1;
      routerLogin = readFromEEPROM(startPos);

    } else {
      // reading routerLogin value
      routerLogin = readFromEEPROM(startPos);
    }

    // reading routerPass value
    startPos += routerLogin.length() + 1;
    routerPass = readFromEEPROM(startPos);

    if (routerPass == ROUTER_PASS) {
      routerPass = "";
    }

    EEPROM.end();
  } else {
    // assigning default values to authorization variables
    apLogin = AP_LOGIN;

    // writing stamp
    startPos = OFFSET;
    stamp = STAMP;
    writeEEPROM(stamp, startPos);

    // writting apLogin
    startPos += stamp.length() + 1;
    writeEEPROM(apLogin, startPos);

    EEPROM.end();
    ESP.reset();
  }
}

void saveCredentials() {
  EEPROM.begin(MEMORY_SIZE);

  // writing stamp
  int startPos = OFFSET;
  stamp = STAMP;
  writeEEPROM(stamp, startPos);

  // writting apLogin
  startPos += stamp.length() + 1;
  writeEEPROM(apLogin, startPos);

  if (settingsStamp == SETTINGS_STAMP) {
    // writting settingsStamp
    startPos += apLogin.length() + 1;
    writeEEPROM(settingsStamp, startPos);

    // writting slaveServer
    startPos += settingsStamp.length() + 1;
    writeEEPROM(slaveServer, startPos);

    // writing routerLogin
    startPos += slaveServer.length() + 1;
    writeEEPROM(routerLogin, startPos);
  } else {
    // writing routerLogin
    startPos += apLogin.length() + 1;
    writeEEPROM(routerLogin, startPos);
  }

  // writing routerPass
  startPos += routerLogin.length() + 1;
  writeEEPROM(routerPass, startPos);

  EEPROM.end();
}

void setup() {
  pinMode(SAPS_BTN_PIN, INPUT);
  pinMode(LED_PIN, OUTPUT);
  pinMode(DAT_PIN0, INPUT);
  pinMode(DAT_PIN1, INPUT);
  pinMode(DAT_PIN2, INPUT);
  pinMode(DAT_PIN3, INPUT);
  pinMode(DAT_PIN4, INPUT);
  fidoDelay(500);

  WiFi.disconnect();
  fidoDelay(1000);
  WiFi.softAPdisconnect(true);
  fidoDelay(2000);
  loadCredentials();
  fidoDelay(2000);
  WiFi.mode(WIFI_STA);
  WiFi.begin(routerLogin.c_str(), routerPass.c_str());
  fidoDelay(500);
}

String replaceASCIICode(String txt) {
  String result;
  unsigned int idx = 0;

  while (idx < txt.length()) {
    if (txt[idx] == '%') {
      String numString = "0x" + String(txt[idx + 1]) + String(txt[idx + 2]);
      char ch = (char)(int)strtol(numString.c_str(), NULL, 16);
      result += ch;
      idx += 3;
    } else if (txt[idx] == '+') {
      result += " ";
      idx += 1;
    }
    else {
      result += txt[idx];
      idx += 1;
    }
  }

  return result;
}

String getFieldValue(String txt, String fieldName) {
  if (txt == "") {
    return "";
  }
  int sp = txt.indexOf(fieldName);
  if (sp == -1) {
    return "";
  }
  int ep = txt.indexOf("&", sp);
  if (ep == -1) {
    return replaceASCIICode(txt.substring(sp + fieldName.length() + 1));
  }
  return replaceASCIICode(txt.substring(sp + fieldName.length() + 1, ep));
}

void handleRouter() {
  String postBody = server.arg("plain");
  if (postBody.length() > 0) {
    routerLogin = getFieldValue(postBody, "ssid");
    routerPass = getFieldValue(postBody, "routerPass");
    if (routerPass == "") {
      routerPass = ROUTER_PASS;
    }
    if (routerLogin != "" && routerPass != "") {
      saveCredentials();
      ESP.reset();
    }
  } else {
    writeScanNetworks();
    server.send(200, "text/html", routerHTML());
  }
}

void startHTTPServer() {
  server.on("/", handleRouter);
  fidoDelay(10);
  server.begin();
}

void setupAccessPoint() {
  bool apActivated = false;
  while (!apActivated) {
    apActivated = WiFi.softAP(apLogin, "", CHANNEL);
    fidoDelay(10);
  }
}

void startAPAndServer() {
  int sapsCounter = 0;

  while (digitalRead(SAPS_BTN_PIN) == HIGH) {
    fidoDelay(1);
    sapsCounter++;
    if (sapsCounter == 4000) {
      digitalWrite(LED_PIN, LOW);
      break;
    }
  }

  if (sapsCounter == 4000) {
    setupAccessPoint();
    fidoDelay(100);
    startHTTPServer();
    fidoDelay(100);
    while (1) {
      server.handleClient();
    }
  }
}

void gerkonLogic() {
    if (digitalRead(DAT_PIN0) == HIGH) {
      datPin0 = "ON";
    }
    if (digitalRead(DAT_PIN0) == LOW) {
      datPin0 = "OFF";
    }
    if (digitalRead(DAT_PIN1) == HIGH) {
      datPin1 = "ON";
    }
    if (digitalRead(DAT_PIN1) == LOW) {
      datPin1 = "OFF";
    }
    if (digitalRead(DAT_PIN2) == HIGH) {
      datPin2 = "ON";
    }
    if (digitalRead(DAT_PIN2) == LOW) {
      datPin2 = "OFF";
    }
    if (digitalRead(DAT_PIN3) == HIGH) {
      datPin3 = "ON";
    }
    if (digitalRead(DAT_PIN3) == LOW) {
      datPin3 = "OFF";
    }
    if (digitalRead(DAT_PIN4) == HIGH) {
      datPin4 = "ON";
    }
    if (digitalRead(DAT_PIN4) == LOW) {
      datPin4 = "OFF";
    }
}

String sendRequest(String url, String json) {
  WiFiClient client;
  HTTPClient http;

