ObidjonovM/codes_for_mikrocontrollers/ESP8266_Gerkon/ESP8266_D1_mini_Gerkon_M1_V1/src/main.cpp
  if (http.begin(client, url)) {
    http.addHeader("Content-Type", "application/json");
    int httpCode = http.POST(json);
    
    if (httpCode == HTTP_CODE_OK) {
      return http.getString();
    } else {
      return String(httpCode);
    }
  }
  return "-1";
}

String extractFromJSON(String respContent, String cmd) {
  int st_index = respContent.indexOf(cmd);
  if (st_index == -1) {
    return "";
  }

  st_index += cmd.length() + 1;
  char lastQuoteCmd = respContent[st_index - 1];
  st_index = respContent.indexOf("\"", st_index);
  if (st_index == -1 || String(lastQuoteCmd) != "\"") {
    return "";
  }

  int end_index = respContent.indexOf("\"", st_index + 1);
  if (end_index == -1) {
    return "";
  }
  
  return respContent.substring(st_index + 1, end_index);
}

void getFromDevice() {
  httpResp = sendRequest(slaveServer + END_POINT, 
                      "{\"device_name\":\"" + DEVICE_NAME + "\", " +
                      +"\"serial_num\":\"" + SERIAL_NUMBER + "\", " +
                      +"\"actions\":" + ACTIONS + ", " +
                      +"\"states\":{" +
                          +"\"action_states\":[" +
                            +"\"" + datPin0 + "\", " +
                            +"\"" + datPin1 + "\", " +
                            +"\"" + datPin2 + "\", " +
                            +"\"" + datPin3 + "\", " +
                            +"\"" + datPin4 + "\"" +
                          +"]" +
                      +"}, " +
                      +"\"slave_server\":\"" + slaveServer + "\"}");
}

void deviceSettings(String httpResp) {
  String slave_server = extractFromJSON(httpResp, "slave_server");

  if (slave_server != "" && slave_server != slaveServer) {
    slaveServer = slave_server;
    mustWriteEEPROM = true;
  }
}

void getDeviceSettings() {
  settingsHttpResp = sendRequest(PB_SERVER + SETTINGS_END_POINT, 
                              "{\"serial_num\":\"" + SERIAL_NUMBER + "\"}");
  deviceSettings(settingsHttpResp);
}

void establishConnection(int numTrails) {
  int trailCounter = 0;
  while (WiFi.status() != WL_CONNECTED) {
    if (trailCounter < numTrails) {
      gerkonLogic();
      startAPAndServer();
      fidoDelay(10);
      trailCounter++;
    } else {
      break;
    }
  }
}

void loop() {
  startAPAndServer();
  if (settingsStamp == SETTINGS_STAMP) {
    gerkonLogic();
    if (WiFi.status() == WL_CONNECTED) {
      digitalWrite(LED_PIN, HIGH);
      getFromDevice();
      if (!wasConnected) {
        getDeviceSettings();
        if (mustWriteEEPROM) {
          saveCredentials();
          mustWriteEEPROM = false;
          ESP.reset();
        }
        wasConnected = true;
      }
    } else {
      wasConnected = false;
      digitalWrite(LED_PIN, LOW);
      establishConnection(connReistTrails);
    }
    fidoDelay(measureDelay);
  } else {
    if (WiFi.status() == WL_CONNECTED) {
      getDeviceSettings();
      if (mustWriteEEPROM == true) {
        settingsStamp = SETTINGS_STAMP;
        saveCredentials();
        ESP.reset();
      }
    }
  }
}